# Relatório de Análise IV

### Seleções e Frequencias

In [1]:
import pandas as pd

In [4]:
dados = pd.read_csv('./data/aluguel_residencial.csv', sep=';')

In [11]:
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN

### Selecione somente os imóveis classificados com tipo 'Apartamento'

In [9]:
selecao = dados['Tipo'] == 'Apartamento'
n1 = dados[selecao].shape[0]
n1

19532

### Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'

In [12]:
selecao = (dados['Tipo'] == 'Casa') | (dados['Tipo'] == 'Casa de Condomínio') | (dados['Tipo'] == 'Casa de Vila')
n2 = dados[selecao].shape[0]
n2

2212

### Selecione os imóveis com área entre 60 e 100 metros quadrados, icluindo os limites
#### 60 <= Area <= 100

In [13]:
selecao = (dados['Area'] >= 60) & (dados['Area'] <= 100)
n3 = dados[selecao].shape[0]
n3

8719

### Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00

In [14]:
selecao = (dados['Quartos'] >= 4) & (dados['Valor'] < 2000)
n4 = dados[selecao].shape[0]
n4

41

### Exercicios

In [18]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [19]:
alunos.head()

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
1  Cátia     27    F    2.5     False
2  Denis     56    M    5.0     False
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True

In [24]:
aprovados = alunos['Aprovado']
apro = alunos[aprovados]
apro

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [32]:
aprovadas = (alunos['Aprovado']) & (alunos['Sexo'] == 'F')
aprova = alunos[aprovadas]
aprova

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [35]:
idade = (alunos['Idade'] > 10)  & (alunos['Idade'] < 20) | (alunos['Idade'] >= 40)
idad = alunos[idade]
idad

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False